#####################################################################################################
# Script id   : 칭찬(김해).R
# Script Name : 김해시 칭찬합시다 분석 
# Input       : C:/01.Project/01.분석참조모델/Rscript/칭찬
#		00. Load R Sources.R / 01. Load Data(김해).R / 02. Preprocessing.R / 
#		03-1. EDA_histogram.R / 03-2. EDA_title.R / 03-3. EDA_content.R /
#		05. keyword_DT.R / 06. keyword_EDA.R / 07. keyword_aruls.R /
#		08-1. keyword_DTM.R / 08-2. keyword_aruls.R / 09. Tableau.R /
#		load_library.R / make_dtm.R / morph_analysis.R / preprocessing.R
# Output      : C:/01.Project/01.분석참조모델/Result/칭찬/
# Author      : 김태환
# sub author  : 김아현
# Date        : 2016.12.05
#####################################################################################################
## 00. R 소스 불러오기 (Load R Sources)
#####################################################################################################
source('C:/01.Project/01.분석참조모델/Rscript/칭찬/00. Load R Sources.R', encoding = "UTF-8")

#####################################################################################################
## 01. 데이터 불러오기 (Load Data Files)
#####################################################################################################
# Data폴더에서 칭찬 파일 확인
source('C:/01.Project/01.분석참조모델/Rscript/칭찬/01. Load Data.R', encoding = "UTF-8")

#####################################################################################################
## 02. 데이터 전처리 (Data Preprocessing)
#####################################################################################################
source('C:/01.Project/01.분석참조모델/Rscript/칭찬/02. Data_Preprocessing.R', encoding = "UTF-8")

#####################################################################################################
## 03. 민원 현황분석
#####################################################################################################
source('C:/01.Project/01.분석참조모델/Rscript/칭찬/03-1. EDA_histogram.R', encoding = "UTF-8")
source('C:/01.Project/01.분석참조모델/Rscript/칭찬/03-2. EDA_title.R', encoding = "UTF-8")
source('C:/01.Project/01.분석참조모델/Rscript/칭찬/03-3. EDA_content.R', encoding = "UTF-8")

#####################################################################################################
## 04. 대상 정의
#####################################################################################################
# 1. 버스
# 2. 보건소
# 3. 시청
# 4. 사무소
# 5. 문화축제
# 6. 기타

#####################################################################################################
## 05. 대상별 현황분석
#####################################################################################################
# 0) 소스 불러오기
source('C:/01.Project/01.분석참조모델/Rscript/칭찬/05. keyword_DT.R', encoding = "UTF-8")
# 1) 버스
#re_DT_버스 <- keyword_DT(keyword = '버스')
# 2) 보건소
re_DT_보건소 <- keyword_DT(keyword = '보건소')
# 3) 시청
re_DT_시청 <- keyword_DT(keyword = c('시청', '주무관', '사무관'))
# 4) 사무소
re_DT_사무소 <- keyword_DT(keyword = c('읍사무소', '면사무소', '동사무소', '계장님'))
# 5) 문화축제
re_DT_문화축제 <- keyword_DT(keyword = c('문화축제', '합창단', '연주회', '연주', '음악', '공연', '문화축제', '문화원', '축제'))
# 6) 기타
re_DT_기타 <- keyword_exclude_DT(keyword = c('버스', '보건소', '시청', '주무관', '사무관', '읍사무소', '면사무소', '동사무소', '계장님', '합창단', '연주회', '연주', '음악', '공연', '문화축제', '문화원', '축제'))

#####################################################################################################
## 06. 키워드 현황분석
#####################################################################################################
source('C:/01.Project/01.분석참조모델/Rscript/칭찬/06. Keyword_EDA.R', encoding = "UTF-8")

#####################################################################################################
## 07. 연관성 분석
#####################################################################################################
source('C:/01.Project/01.분석참조모델/Rscript/칭찬/07. aruls.R', encoding = "UTF-8")
aruls(dtm = dtm_내용_전체민원, supp = 0.3, conf = 0.3)

#####################################################################################################
## 08. 대상별 키워드 분석
#####################################################################################################
# 0) 소스 불러오기
source('C:/01.Project/01.분석참조모델/Rscript/칭찬/08-1. keyword_DTM.R', encoding = "UTF-8")
source('C:/01.Project/01.분석참조모델/Rscript/칭찬/08-2. keyword_aruls.R', encoding = "UTF-8")
# 1) 버스
# dtm_버스 <- keyword_DTM(data = re_DT_버스, keyword = '버스')
# keyword_aruls(dtm = dtm_버스, keyword = '버스', supp = 0.15, conf = 0.15)
# # 2) 보건소
# dtm_보건소 <- keyword_DTM(data = re_DT_보건소, keyword = '보건소')
# keyword_aruls(dtm = dtm_보건소, keyword = '보건소', supp = 0.15, conf = 0.15)
# # 3) 시청
# dtm_시청 <- keyword_DTM(data = re_DT_시청, keyword = '시청')
# keyword_aruls(dtm = dtm_시청, keyword = '시청', supp = 0.15, conf = 0.15)
# # 4) 사무소
# dtm_사무소 <- keyword_DTM(data = re_DT_사무소, keyword = '사무소')
# keyword_aruls(dtm = dtm_사무소, keyword = '사무소', supp = 0.15, conf = 0.15)
# # 5) 문화축제
# dtm_문화축제 <- keyword_DTM(data = re_DT_문화축제, keyword = '문화축제')
# keyword_aruls(dtm = dtm_문화축제, keyword = '문화축제', supp = 0.15, conf = 0.15)
# # 6) 기타
# dtm_기타 <- keyword_exclude_DTM(data = re_DT_기타, keyword = '기타')
# keyword_aruls(dtm = dtm_기타, keyword = '기타', supp = 0.15, conf = 0.15) # 샘플데이터 양 부족으로 실행 불가

#####################################################################################################
## 09. Tableau Output
#####################################################################################################
source('C:/01.Project/01.분석참조모델/Rscript/칭찬/09. Tableau.R', encoding = "UTF-8")

#####################################################################################################