#####################################################################################################
# Script id   : 콜센터.R
# Script Name : 콜센터 분석 
# Input       : C:/01.Project/01.분석참조모델/Rscript/콜센터
#		00. Load R Sources.R / 01. Load Data.R / 02. Data_Preprocessing.R / 
#		03. EDA.R / 04. SNA_dtm.R / 05. aruls_dtm.R / 09. Tableau.R /
#		load_library.R / make_dtm.R / morph_analysis.R / preprocessing.R
# Output      : C:/01.Project/01.분석참조모델/Result/콜센터/
# Author      : 김태환
# sub author  : 김아현
# Date        : 2016.12.05
#####################################################################################################
## Load R Sources
#####################################################################################################
source('C:/01.Project/01.분석참조모델/Rscript/콜센터/00. Load R Sources.R', encoding = "UTF-8")

#####################################################################################################
## 01. 데이터 불러오기 (Load Data Files)
#####################################################################################################
source('C:/01.Project/01.분석참조모델/Rscript/콜센터/01. Load Data.R', encoding = "UTF-8")

#####################################################################################################
## 02. 데이터 전처리 (Data Preprocessing)
#####################################################################################################
source('C:/01.Project/01.분석참조모델/Rscript/콜센터/02. Data_Preprocessing.R', encoding = "UTF-8")

#####################################################################################################
## 03. 민원 현황분석
#####################################################################################################
source('C:/01.Project/01.분석참조모델/Rscript/콜센터/03. EDA.R', encoding = "UTF-8")

#####################################################################################################
## 04. 소셜 네트워크 분석 (SNA : Social Network Analysis)
#####################################################################################################
source('C:/01.Project/01.분석참조모델/Rscript/콜센터/04. SNA_dtm.R', encoding = "UTF-8")
# dtmx <- removeSparseTerms(dtm_y_DT_2011, 0.99)	# term의 갯수를 조정
# SNA_dtm(dtm = dtmx, term = 2011)
# dtmx <- removeSparseTerms(dtm_y_DT_2012, 0.99)	# term의 갯수를 조정
# SNA_dtm(dtm = dtmx, term = 2012)
# dtmx <- removeSparseTerms(dtm_y_DT_2013, 0.99)	# term의 갯수를 조정
# SNA_dtm(dtm = dtmx, term = 2013)
# dtmx <- removeSparseTerms(dtm_y_DT_2014, 0.99)	# term의 갯수를 조정
# SNA_dtm(dtm = dtmx, term = 2014)
# dtmx <- removeSparseTerms(dtm_y_DT_2015, 0.99)	# term의 갯수를 조정
# SNA_dtm(dtm = dtmx, term = 2015)
dtmx <- removeSparseTerms(dtm_y_DT_2016, 0.99)	# term의 갯수를 조정
SNA_dtm(dtm = dtmx, term = 2016)

#####################################################################################################
## 05. 연관성 분석 (Association Rules Analysis)
#####################################################################################################
source('C:/01.Project/01.분석참조모델/Rscript/콜센터/05. aruls_dtm.R', encoding = "UTF-8")
aa_list <- ls(pattern = "dtm_tmp")
aa_list
# [1] "dtm_tmp_상담대분류_교통/차량등록" "dtm_tmp_상담대분류_기타"          "dtm_tmp_상담대분류_민원/허가"     "dtm_tmp_상담대분류_복지"         
# [5] "dtm_tmp_상담중분류_120기동"       "dtm_tmp_상담중분류_NA"            "dtm_tmp_상담중분류_교통지도"      "dtm_tmp_상담중분류_기타"         
# [9] "dtm_tmp_상담중분류_여권"          "dtm_tmp_상담중분류_주민생활지원" 
dtmx <- removeSparseTerms(get(aa_list[2]), 0.999)	# term의 갯수를 조정
aruls_dtm(dtm = dtmx, category1 = '상담대분류', category2 = '기타', supp = 0.01, conf = 0.01)

#####################################################################################################
## 09. Tableau Output
#####################################################################################################
source('C:/01.Project/01.분석참조모델/Rscript/콜센터/09. Tableau.R', encoding = "UTF-8")

#####################################################################################################
